s = "Возьмите текст этого задания и извлеките из него все слова, количество символов в которых больше 5. Подсчитайте количество слов и выведите их в алфавитном порядке."


arr = s.split().map{|item| item[-1].match(/\.|\,|\!|\?|\'|\"/) ? item[0...-1].downcase : item.downcase  }
result = arr.select{|item| item.size >5} 
puts '----------------------------------------------------'
puts "there are #{result.size} words with more than 5 symbols"
puts '----------------------------------------------------'
puts result.sort
puts '----------------------------------------------------'