1. Создайте константы, которые содержат названия дней недели. Используя эти
константы, сформируйте массив дней недели и присвойте его константе WEEK.
Выведите содержимое массива в консоль.
2. Создайте программу number.rb, которая принимает в качестве аргумента целое
число, — например: number.rb 15. В качестве результата программа должна со-
общать, передано ей четное или нечетное число.
3. Создайте программу factorial.rb, которая принимает в качестве аргумента целое
число, — например: factorial.rb 5. В качестве результата программа должна
выводить факториал переданного числа (факториалом здесь будет произведение
всех чисел от 1 до 5: 1 × 2 × 3 × 4 × 5 = 120).
4. Создайте программу sum.rb, которая принимает в качестве аргументов последо-
вательность чисел, — например: sum.rb 6 3 7 12 2. Подсчитайте сумму чисел и
выведите результат.
5. Создайте программу age.rb, которая принимает год, месяц и день рождения поль-
зователя. Вычислите возраст пользователя и выведите результат.
6. Создайте класс Hello в файле hello.rb. Внутри класса необходимо реализовать
метод hello, который выводит приветствие в зависимости от текущего времени
суток. С 6:00 до 12:00 метод должен возвращать «Доброе утро», с 12:00 до 18:00 —
«Добрый день», с 18:00 до 00:00 — «Добрый вечер», с 00:00 до 6:00 — «Доброй
ночи». Подключите класс в файле main.rb и выведите приветствие с его помощью.